let questions = [
    {
        "question":"你更容易被哪種說法說服？",
        "answers":[
            ["這是有根據的", 2],
            ["這感覺是對的", 3],
            ["以根據來說，我的感覺都會是對的", 4]
        ]
    },
    {
        "question":"你比較在意？",
        "answers":[
            ["結果是否正確", 3],
            ["過程是否合理", 4],
            ["薪資是否正確，年終是否合理", 5]
        ]
    },
    {
        "question":"你比較重視？",
        "answers":[
            ["當下的感受", 4],
            ["長期的感覺", 5],
            ["長崎的蛋糕", 6]
        ]
    },
    {
        "question":"當你做錯決定時，你會？",
        "answers":[
            ["檢討邏輯", 5],
            ["覺得資訊不夠", 6],
            ["檢討提出問題的人", 7]
        ]
    },
    {
        "question":"當別人不理解你時，你會？",
        "answers":[
            ["嘗試解釋", 6],
            ["覺得算了", 7],
            ["跟他鬥毆", 8]
        ]
    },
    {
        "question":"你比較害怕？",
        "answers":[
            ["做錯選擇", 7],
            ["錯過機會", 8],
            ["薯條被搶", "A"]
        ]
    },
    {
        "question":"當事情出錯時，你會？",
        "answers":[
            ["修正方法", 8],
            ["重新規劃", 9],
            ["重新投胎", 10]
        ]
    },
    {
        "question":"當情緒不好時，什麼樣的人事物更能安慰你？",
        "answers":[
            ["自己消化獨處", 9],
            ["大薯買一送一", "A"],
            ["拿一千萬現金給你擦眼淚的男生", "B"]
        ]
    },
    {
        "question":"你比較在意？",
        "answers":[
            ["陶朱隱園", "B"],
            ["薯條被朋友幹走一根", "A"],
            ["蛋塔沒有優惠", "D"]
        ]
    },
    {
        "question":"下面哪一種餐盒免費送，你最想要？",
        "answers":[
            ["鰻魚飯", "C"],
            ["蛋塔六入", "D"],
            ["大薯兩包", "A"]
        ]
    }
    
];

/*
let finalAnswers={
    "A":["愛情有點酸","在今年，你的愛情有一些酸哦，不過還好，不苦，而且有時候雖然酸，酸中也帶了絲甜。即使你會與喜歡的人沒有緣分走到一起，但是你們彼此能祝福對方。心中有些酸，是因為你看得開。現在對愛情真的看得淡了，不會強求，也不渴望什麼轟轟烈烈，甜甜蜜蜜，只希望過了這陣酸，會有甜頭來。"],
    "B":["愛情超級甜","在今年裡，你的愛情超級甜蜜哦，真的有如蜜糖一樣甜，不時撒一把狗糧，能讓旁邊的人都覺得發膩哦。當然啦，你這麼幸運，遇到甜蜜的愛情，也是因為你是一個溫暖的人啊，值得這麼好的愛情，也值得別人好好疼愛你。你也會加倍珍惜，好好回饋對方，這樣才是愛情的正確打開方式。"],
    "C":["愛情有苦有甜","你在今年的愛情，一定是有苦也有甜的，其實這才是正常的感情，或者說普通的感情。有的人一直甜蜜，他們是幸運兒。而你是普通人，感情中會有甜蜜的時候，也會有爭吵矛盾，會有淚水，會有痛苦。但是學會理智經營感情，在甜的時候好好享受，在苦的時候及時審視，愛情才能持久。"],
    "D":["愛情平淡沒滋味","今年裡，你的愛情沒有啥滋味，可能你根本就遇不到愛情，繼續又單身一整年，這樣也好，你可以忙於賺錢。也可能你的愛情就是有如一碗平平淡淡的白開水，沒有什麼滋味，但是沒有它又不行。或者是缺少了一些刺激，但是誰的愛情能一直轟轟烈烈呢？平淡如水，細水長流，未嘗不是一件好事。"]
};
*/

let finalAnswers={
        "A":["薯條愛好者", "那你也是很在意薯條了"],
        "B":["做夢吧", "去睡覺吧，夢裡甚麼都有"],
        "C":["自己出錢啊", "覺得別人會請吃鰻魚飯是甚麼心態？"],
        "D":["你好了啦", "又一個不想花錢買蛋塔的人"]
};
